GetLoadCombinationsSelectedForDisplay
Syntax
cDatabaseTables.GetLoadCombinationsSelectedForDisplay
VB6 Procedure
Function GetLoadCombinationsSelectedForDisplay (ByRef NumberSelectedLoadCombinations As Integer, ByRef LoadCombinationList As As String()) As Integer
Parameters
NumberSelectedLoadCombinations
Returned Item: The number of load combinations selected for table display.
LoadCombinationList
Returned Item: The zero-based list of load combinations selected for table display.
Remarks
Returns a list of load combinations that are selected for table display.
This list sets the load combinations that are included when displaying load assignments on the model.
Release Notes
Initial release in version 23.0.0
See Also
SetLoadCombinationsSelectedForDisplay